src/Catalogs/Карты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Карты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийКодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаУдалена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКартыОктаграм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУстановок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьБиометрию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаУстановкуКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтекОбновленияЭлектронныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтекОбновленияЭлектронныхКарт</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Карты/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура, обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("ЭтоНовый, КодДоИзменения", НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка), Ссылка.КодКарты);
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("КартаДоИзменения", СтруктураРеквизитов);
	
	ЭтоНоваяКартаWallet = ЭтоНовый() И ТипКода = Перечисления.ВидыКарт.Wallet;
	ОбновитьКарту 	    = Не ЭтоНовый() И ТипКода = Перечисления.ВидыКарт.Wallet 
	И ВладелецКарты <> Ссылка.ВладелецКарты И ЗначениеЗаполнено(ЭтотОбъект.ВнутреннийКодКарты); // сменился владелец, обновляем карту
	
	Если Не ПометкаУдаления И Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ВнешнийИсточник") Тогда   
		
		Если ЭтоНоваяКартаWallet Или ОбновитьКарту Тогда
			
			ВнешняяСистемаWallet = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.Wallet);
			
			Если Не (ЗначениеЗаполнено(ВнешняяСистемаWallet.ТокенДоступа) И ЗначениеЗаполнено(ВнешняяСистемаWallet.КлючШифрования)) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена или не настроена внешняя система ""Wallet""",,,, Отказ);
				Возврат;
			КонецЕсли;
			
			Если ЭтоНоваяКартаWallet Тогда
				
				Результат = Справочники.Карты.СоздатьКартуWallet(ВнешняяСистемаWallet, ВидКарты.ИдентификаторПроекта, ЭтотОбъект.ВладелецКарты);
				
				ВнутреннийКодКарты     = Результат.ВнутреннийКодКарты;
				КодКарты		       = Результат.КодКарты;
				СсылкаНаУстановкуКарты = Результат.Ссылка;
				
			Иначе // обновляем карту
				
				Результат = Справочники.Карты.ОбновитьКартуWallet(ЭтотОбъект, ВнешняяСистемаWallet, Истина);
				
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки);
			КонецЕсли;
			
			Отказ = Не Результат.Успешно; 
			
			ЭтотОбъект.Наименование = ?(Не Отказ, Строка(ЭтотОбъект.КодКарты) +", " + Строка(ЭтотОбъект.ВладелецКарты) + " (" + ЭтотОбъект.ТипКода + ")", "");	
			
			
			Если Результат.СинхронизироватьНомерТелефона Тогда
				ЭтотОбъект.ДополнительныеСвойства.Вставить("СинхронизироватьНомерТелефона");
			КонецЕсли;  
			
		ИначеЕсли ТипКода = Перечисления.ВидыКарт.Штриховая И ЗначениеЗаполнено(КодКарты) Тогда 
			
			Отказ = Справочники.Карты.ПроверитьНаличиеШтрихКода(Ссылка, КодКарты);  			
			
		ИначеЕсли ТипКода = Перечисления.ВидыКарт.Магнитная
			И ЗначениеЗаполнено(КодКарты) Тогда
			
			Отказ = Справочники.Карты.ПроверитьНаличиеМагнитногоКода(Ссылка, КодКарты);
			
		КонецЕсли;	
		
	КонецЕсли;
	
	// Карта создана через виджет Wallet,
	// отправляем данные владельца для обновления полей карты.
	
	Если ЭтоНоваяКартаWallet = Истина
		И ЭтотОбъект.ДополнительныеСвойства.Свойство("ВнешнийИсточник")
		И ЭтотОбъект.ДополнительныеСвойства.ВнешнийИсточник = Истина Тогда
		
		ВнешняяСистемаWallet = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.Wallet);
		
		Если ЗначениеЗаполнено(ВнешняяСистемаWallet.ТокенДоступа) И ЗначениеЗаполнено(ВнешняяСистемаWallet.КлючШифрования) Тогда
			
			Результат = Справочники.Карты.ОбновитьКартуWallet(ЭтотОбъект, ВнешняяСистемаWallet, Ложь);
			ЭтотОбъект.ДополнительныеСвойства.Вставить("СинхронизироватьНомерТелефона");

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обработчик события "ПриЗаписи" элемента справочника
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда		
		 Возврат;		 
	КонецЕсли;
	
	Если ПометкаУдаления И ТипКода = Перечисления.ВидыКарт.Штриховая Тогда 		
		
		НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Использование = Истина;
		НаборЗаписей.Отбор.Объект.Значение      = Ссылка;
		НаборЗаписей.Записать();
		
	ИначеЕсли Не ПометкаУдаления И (ТипКода = Перечисления.ВидыКарт.Штриховая
										Или ТипКода = Перечисления.ВидыКарт.Wallet) Тогда
		
		Если ЗначениеЗаполнено(КодКарты) Тогда
			Отказ = Справочники.Карты.ПроверитьНаличиеШтрихКода(Ссылка, КодКарты);
		КонецЕсли;
		
		// очистка данных из регистра
		НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Объект.Установить(Ссылка);
		НаборЗаписей.Записать(); 
		
		Если ЗначениеЗаполнено(КодКарты) Тогда
			// добавление данных в регистр
			НоваяЗапись = НаборЗаписей.Добавить();	
			НоваяЗапись.Объект   = Ссылка;
			НоваяЗапись.Штрихкод = СокрЛП(КодКарты);
			НаборЗаписей.Записать();
		КонецЕсли; 

	ИначеЕсли Не ПометкаУдаления
		И ТипКода = Перечисления.ВидыКарт.Магнитная
		И ЗначениеЗаполнено(КодКарты) Тогда
		
		Отказ = Справочники.Карты.ПроверитьНаличиеМагнитногоКода(Ссылка, КодКарты);
		
	КонецЕсли;
	
	// Номер телефона не синхронизировался при создании/обновлении карты,
	// синхронизируем через регламент
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СинхронизироватьНомерТелефона") Тогда
		
		КонтактнаяИнформация = Справочники.Контрагенты.ПолучитьКонтактнуюИнформациюКлиента(ЭтотОбъект.ВладелецКарты, Истина);
		
		Если ЗначениеЗаполнено(КонтактнаяИнформация.Телефон) Тогда		
			
			НомерТелефонаВрем = ?(Лев(КонтактнаяИнформация.Телефон, 1) = "+", КонтактнаяИнформация.Телефон, "+" + КонтактнаяИнформация.Телефон); 
			РегистрыСведений.СтекОбновленияЭлектронныхКарт.ДобавитьЗаписьВСтек(ЭтотОбъект.Ссылка, "phone_number", НомерТелефонаВрем);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
			
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда 
		
		Если ДанныеЗаполнения.Свойство("ЭтоРегистрацияПосещения") Тогда  
			
			ВладелецКарты = ДанныеЗаполнения.ВладелецКарты;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипКода = Перечисления.ВидыКарт.Wallet Тогда
		
		Если ПроверяемыеРеквизиты.Найти("ВладелецКарты") = Неопределено Тогда
			ПроверяемыеРеквизиты.Добавить("ВладелецКарты");			
		КонецЕсли;
		
		Если ПроверяемыеРеквизиты.Найти("ВидКарты") = Неопределено Тогда
			ПроверяемыеРеквизиты.Добавить("ВидКарты");			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
